[
  {
    "path": "notes/2024-06-20-argo-canada-data-management-team-updates-june-21-2024/",
    "title": "Argo Canada Data Management Team Updates - June 21, 2024",
    "description": "Summary of updates for meeting taking plaace on June 21, 2024.",
    "author": [
      {
        "name": "Christopher Gordon",
        "url": "https://github.com/cgrdn"
      }
    ],
    "date": "2024-06-20",
    "categories": [],
    "contents": "\nChris’ notes before the meeting are in regular text. Notes taken during the meeting are in italics.\nRecent Deployments\nRecent deployments (since May 1) include 5 floats in the Lab Sea (3 Dal CTS5, 2 BIO CTS4), 1 float deployed from the sailing vessel Oceanolog (read more here), and 2 floats deployed along line P (1 deep ARVOR, 1 CTS4 w/ Nitrate).\nGoing a little further back, in April 4 floats were deployed, 2 on the AZMP (BIO CTS4) and 2 southeast of South Africa (ARVOR).\nDal floats: profiled daily while ship was in the area, now on 5-day cycles. Parking at 2000m to use as a pseudo-sediment trap via the BBP parking hook (see here for an example)\nNitrate float (4902679) is not on GDAC yet (Nitrate processing in progress), profiling daily?\n\n\nProgram\nInstitute\nModel\nDate\nLatitude\nLongitude\nShip\nIMEI\nWMO\nSerial No.\nArgo Canada\nIOS\nPROVOR\n04 May, 2024\n49.2800\n-134.6700\nJOHN P. TULLY\n300125010116590\n4902679\nP44168-23CA001\nArgo ONC\nONC\nDeep ARVOR\n07 May, 2024\n49.8361\n-144.6701\nJOHN P. TULLY\n300534063507930\n4902631\nAD2700-22CA001\nArgo Dalhousie\nDal\nPROVOR\n13 May, 2024\n56.5010\n-52.5990\nCELTIC EXPLORER\n300125062423120\n4902686\nP53865-23CA003\nArgo Canada\nBIO\nARVOR\n16 May, 2024\n17.9857\n-65.0987\nOCEANOLOG\n300534062474370\n4902609\nAI2600-22CA007\nArgo Dalhousie\nDal\nPROVOR\n17 May, 2024\n56.6650\n-48.9770\nCELTIC EXPLORER\n300125062031400\n4902687\nP53865-23CA004\nArgo Dalhousie\nDal\nPROVOR\n22 May, 2024\n58.4275\n-49.4418\nCELTIC EXPLORER\n300125062035430\n4902688\nP53865-23CA005\nArgo Canada\nBIO\nPROVOR\n06 Jun, 2024\n59.5045\n-55.0209\nCAPT. JACQUES CARTIER\n300125010915310\n4902675\nP41305-23CA002\nArgo Canada\nBIO\nPROVOR\n06 Jun, 2024\n59.5044\n-55.0210\nCAPT. JACQUES CARTIER\n300125010917310\n4902677\nP41305-23CA004\n\nArctic & Antarctic Floats\n\nWMO\nBasin\nDeployment Date\nLast Cycle\nLast Cycle Date\n4902610\nBeaufort Sea\nSep 19, 2023\n29\nJun 21, 2024\n4902611\nBeaufort Sea\nOct 03, 2023\n25\nMay 27, 2024\n4902664\nRoss Sea\nFeb 07, 2024\n11\nFeb 28, 2024\n4902665\nRoss Sea\nJan 30, 2024\n1\nJan 31, 2024\n4902667\nRoss Sea\nFeb 07, 2024\n20\nMar 21, 2024\n4902668\nRoss Sea\nFeb 03, 2024\n8\nMar 02, 2024\n4902669\nRoss Sea\nFeb 07, 2024\n11\nFeb 28, 2024\n\nBeaufort:\nBoth Beaufort Sea floats have resurfaced! 4902610 not on GDAC yet.\nISA does not seem to have prevented floats from approaching/bumping into the ice\nLost some data - ex. 4902611 did 3 cycles before going under ice, but newly sent data starts at cycle 13: reduce vertical resolution before next season?\nRoss:\nMost floats have not reported since near deployment time, but 4902664 just reported on June 16, not on GDAC yet\n\n\n\nNitrate\nWriting of Nitrate RTQC code is in progress. Official documentation is here. RTQC for Nitrate includes:\nglobal range test\nspike test\nstuck value test\ngrey list test\nnitrate specific tests\nSpecific tests include checking for saturation of the spectrophotometer, absorbance at 240nm (evaluate sensor optics) and error fitting to a model. There is also a check for high bisulfide concentrations such as in the black sea, but these are special cases and likely only going to be evaluated by expert researchers.\nLike oxygen, unadjusted nitrate is flagged as 3 by default. If TEMP_QC is 4, NITRATE_QC is also 4, and if PSAL_QC is 4, NITRATE_QC should be 3 as well, including for adjusted, but this can be reviewed at the DMQC step.\nNear Surface Sampling\nAt the most recent AST Brian King presented on an evaluation of Argo floats sampling all the way to the surface. The defauly configuration of the CTD pump for NKE floats is to turn off the pump at 5dbar. I am in the process of changing this parameter to 2dbar for all floats and will use as the default going forward.\n\n\n\n",
    "preview": {},
    "last_modified": "2024-06-25T18:42:16+00:00",
    "input_file": {}
  },
  {
    "path": "notes/2023-11-10-argo-canada-data-management-team-updates-november-10-2023/",
    "title": "Argo Canada Data Management Team Updates - November 10, 2023",
    "description": "Summary for meeting taking place on November 10, 2023.",
    "author": [
      {
        "name": "Christopher Gordon",
        "url": "https://github.com/cgrdn"
      }
    ],
    "date": "2023-11-10",
    "categories": [],
    "contents": "\n\n\n\nUpdate/Takeaways from ADMT\nCHLA_ADJUSTED: Raphaelle Suazede presented on adjusting chlorophyll using a factor from a lookup table (date, location) or calculated based on first 5 cycles. Current process is to divide by 2 for all data (Roesler 2017). Simple to implement in python RTQC once we have LUT.\nRT adjustment of DOXY is a high priority. Can provide a gain value after 5 cycles, and populate DOXY_ADJUSTED in RT at python RTQC step. Chris needs to talk to Anh about this - new VMS variable and populating SCIENTIFIC_CALIB_COMMENT.\nCycle Timing\nCanadian floats are almost all compliant with time of day sampling. Only floats that appeared in Drucker/Riser audit list were NOVA, deep ARVOR floats and 2 very recently deployed ARVORs that have been reprogrammed to 235hr cycles already.\n\n\n\n\n\n\nDiscussion on indicating time of day sampling regime in the meta file by John Gilson via CONFIG_MISSION_COMMENT. Not totally clear to me but I think we are meant to set it to -1 (i.e. TOD sampling off?).\nPresented our method for actively reprogramming PROVOR floats to effectively result in 235 hour cycles.\n\n\n\nPROVOR CTS5 floats: the new floats will require new syntax to reprogram, and also carry radiometry sensors. Plan will be to cycle through 24hr cycle plus extra local noon surfacings through the year.\n\n\n\nRTQC Of PROVOR CTS5 Floats\nNeed to add radiometry RTQC to python setup - just range test, very simple\nDMQC Updates\n4 floats ready for submission, going to do a couple more and submit as a batch\nMaking an effort to do 1-2/week right now\nWill need to spend some time validating in-air method in code\nUpon DMQC, updating DOXY_QC=1 to DOXY_QC=3. Should we do that for all files more urgently?\nDeployment Summary\nAll completed and planned deployments can be seen on the development blog planning page.\nSo far in 2023, 24 floats have been deployed:\n5 PROVOR / 14 ARVOR / 5 deep ARVOR\n11 BIO / 8 IOS / 5 ONC\n3 RBR / 21 SBE\nIn the remainder of 2023 and into early 2024, 13 more deployments are planned:\n2 PROVOR CTS5 / 9 ARVOR / 3 deep ARVOR\n7 BIO / 2 IOS / 2 ONC / 2 Dalhousie\n4 RBR / 9 SBE\nNotable deployments:\nThe crew of the DISCOVREY will be deploying 6 floats on their way to Cape Town, South Africa.\nAn additional 6 floats (not in table) will be delivered to a vessel in Cape Town via the DISCOVERY for deployment in the Western Indian Ocean, date TBD.\nThe HMCS VANCOUVER will deploy 2 floats near Hawaii\nThe 2 PROVOR CTS5 floats will be deployed in the Lab Sea from the MERIAN, being loaded on November 21.\nThe sailing vessel OCEANOLOG will deploy an ARVOR float as part of Sail for Science\n2 deep ARVOR floats will be deployed from the HESPERIDES in the Southern Ocean (more floats to avoid ice!)\nAn additional 5 floats (not in the table) will be sent on a joint Italian/NZ voyage to the Ross Sea\nBeaufort Floats\nFloat Programming\nThe two floats deployed in the Beaufort Sea (4902610 and 4902611) were updated with new ice sensing algorithm (ISA) parameters. The parameters were provided by Steve Jayne based on data analysis of the Beaufort Gyre.\nISA works by detecting a temperature threshold over a certain depth range. The suggested range was between 20-10dbar with a threshold of -1.21deg C (90% success rate of avoiding ice when present) or -1.03 deg C (95% success rate).\nI ran the parameter change by Jerome at NKE. He was cautious about it as the depth range Steve provided was more shallow than their default setting (-1.79 deg C between 50 and 20dbar), but that the changes looked fine in terms of reprogramming the float:\n!MC 2 235    # cycle timing\n!MC 3 235    # cycle timing phase 2, inaccessible\n!MC 17 475   # surface/mid threshold \n!MC 18 1000  # mid/bottom threshold\n!MC 20 5     # mid resolution\n!MC 21 10    # bottom resolution\n!IC 2 3      # number of detections to confirm ice, default\n!IC 3 20     # start pressure detection\n!IC 4 10     # stop pressure detection\n!IC 5 -1210  # temperature threshold, millidegrees\nBoth floats successfully received the parameter change, but I cannot see ice parameter values in the messages. May consult NKE on this.\nPreliminary Data\nFloat 4902610 collected 2 profiles before stopping reporting (last Oct 1, 2023). Float 4902611 has collected 3 (last reported Oct 25, 2023).\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2024-06-25T18:42:16+00:00",
    "input_file": {}
  }
]
