[
  {
    "path": "notes/2024-10-31-canadian-argo-future-planning-and-coordination/",
    "title": "Canadian Argo: Future Planning and Coordination",
    "description": "Contains: info on deployments, planning, float inventory, and expected orders.",
    "author": [
      {
        "name": "Christopher Gordon",
        "url": "https://github.com/cgrdn"
      }
    ],
    "date": "2024-10-31",
    "categories": [],
    "contents": "\n\n\n\nSince 2012, Argo Canada has deployed 412 floats. In recent years, Canada has deployed 46 in 2022, 31 in 2023, and 38 so far in 2024, with 2 planned deployments remaining for the year.\n\n\n\nFrom the rightmost bar it is clear that we are now deploying a diverse set of floats, with additional models/sensors to be added in the next few years.\nThe following 30 floats are left “in stock”, including P43205-22CA004 and P53875-23CA001 which are planned for deployment later this year. This also includes 2 RBR floats that are due to return to BIO following testing at NKE, and 2 ARVORs and 1 PROVOR CTS4 that are being refurbished for elevated vacuum pressure.\n\nWMO\nSerial\nModel\n4902603\nAI2600-22CA001\nARVOR-I\n4902621\nP41305-22CA002\nPROVOR CTS4\n4902629\nP43205-22CA004\nPROVOR CTS4+pH\n4902632\nAD2700-22CA002\nARVOR-I-DEEP\n4902645\nAD2700-22CA003\nARVOR-I-DEEP\n4902646\nAD2700-22CA004\nARVOR-I-DEEP\n4902647\nAD2700-22CA005\nARVOR-I-DEEP\n4902648\nAD2700-22CA006\nARVOR-I-DEEP\n4902661\nAI2632-23CA006\nARVOR-I+O2\n4902666\nAI2600-23CA010\nARVOR-I\n4902672\nAI3500-23CA003\nARVOR-I-RBR\n4902673\nAI3500-23CA004\nARVOR-I-RBR\n4902681\nP44168-23CA003\nPROVOR CTS4+SUNA\n4902682\nP44168-23CA004\nPROVOR CTS4+SUNA\n4902683\nP44168-23CA005\nPROVOR CTS4+SUNA\n4902690\nP53875-23CA001\nPROVOR CTS5+SUNA\n4902691\nP53875-23CA001\nPROVOR CTS5+SUNA\n4902692\nAI2600-24CA001\nARVOR-I\n4902693\nAI2600-24CA002\nARVOR-I\n4902694\nAI2600-24CA003\nARVOR-I\n4902695\nAI2600-24CA004\nARVOR-I\n4902696\nAI2600-24CA005\nARVOR-I\n4902697\nAI2600-24CA006\nARVOR-I\n4902698\nAI2600-24CA007\nARVOR-I\n4902699\nAI2600-24CA008\nARVOR-I\n4902700\nAI2600-24CA009\nARVOR-I\n4902701\nAI2600-24CA010\nARVOR-I\n4902702\nAI2600-24CA011\nARVOR-I\n4902703\nAI2600-24CA012\nARVOR-I\n4902704\nAI2600-24CA013\nARVOR-I\n\n\nFinally, the following floats are on order:\n\nInstitute\nNumber\nFloat\nSensors\nDFO\n7\nAPEX\nSBE CTD\nDFO\n7\nAPEX\nRBR CTD\nDal\n10\nPROVOR CTS5\nSBE CTD, DO Optope, RBR Tridente, OCR\nDal\n17\nPROVOR CTS5\nSBE CTD, DO Optope, RBR Tridente, OCR, Trios OPUS\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-04-12T00:35:48+00:00",
    "input_file": {}
  },
  {
    "path": "notes/2024-10-30-admt-25-meeting-notes/",
    "title": "ADMT-25 Meeting Notes",
    "description": "Notes and action items from the 25th Argo Data Management Team meeting held in Trieste, Italy.",
    "author": [
      {
        "name": "Christopher Gordon",
        "url": "https://github.com/cgrdn"
      }
    ],
    "date": "2024-10-30",
    "categories": [],
    "contents": "\nSummary of relevant actions from the 25th Argo Data Management Team held in Trieste, Italy during October 21-25, 2024. All actions are linked to a github issue in order to effectively track their progress.\nDay 1\nNathan Briggs pointed out that MEDS CTS5 floats appear to be jumping to discrete longitudes. It is all floats so likely a bug/rounding error in their processing at the DAC level. WMO numbers: 4902684-4902688. Action: look into location info on these floats, find source of discrete longitude jumps. (#3)\nRemove inactive, DMQC’ed floats from the greylist (which will soon be renamed). Action: check for any inactive, already D-moded floats on existing greylist. (#4)\nDay 2\nDalhousie is buying new floats with RBR Tridente (chlorophyll, backscatter, 3rd channel) and Trios Opus (nitrate) sensors. These sensors are new to the MEDS data system and in different stages of the Argo data system as well. Tridente sensors are in the experimental phase and will need to be placed in the aux directory at the GDAC, not in the main data system. The Opus sensor I am not sure what phase it is in but may also need to go in the aux directory. Action: (1) verify current sensor phase of the Opus sensor (experimental, pilot, etc) (2) establish processing of Tridente and Opus sensors at MEDS (3) establish new RTQC of Tridente and Opus sensors at MEDS (at least 1+ ADMT away, will await updated manual). (#5)\nHigh quality shipboard measurements alongside deployment of floats equipped with Tridente sensors will be helpful for validation and acceptance into the main data system. See Nathan Briggs TTT presentation. Action: coordinate with Dalhousie to ensure these floats are deployed alongside such measurements, such as on AZMP or AZOMP missions. (#6)\nDay 3\nSome MEDS DOXY_QC=1 still in data system. Action: check remaining DOXY_QC=1, find source, fix. (#7)\nBBP_ADJUSTED not being filled in RT at MEDS. Action: fill BBP_ADJUSTED in RT with 1:1 copy of BBP. (#8)\nIRRADIANCE manual being updated. Action: verify that current processing/flagging of RT irradiance data is correct. (#9)\nNitrate in oxygen deficient zones - see Josh Plant’s presentation. Action: check on oxygen profiles from floats with Nitrate sensors. (#10)\nUpon implementation of geographically defined CHLA adjustment, must fill SCIENTIFIC_CALIB fields. Action: await official documentation on implementation, request standard formulation of SCIENTIFIC_CALIB fields for homogeneity in the data system.\nJosh Plant now using WOA23 for oxygen audit over WOA18. Action: update reference source for bgcArgoDMQC package. (#74)\nJosh Plant pointed out some MEDS floats with variable gains. I recognized the WMO numbers as floats that had been adjusted by Henry Bittig. The three of us discussed and Henry explained that this was from a batch of optodes that were batch calibrated with poor temperature characterization. Thus the gains are temperature dependent, but correct. No action required.\nDay 4\nUS to adopt a standard “intermediate” data format/template, as individual programs forward the data onto the AOML DAC. No action required but could be useful to keep an eye on as a common archive format.\nShould confirm with OceanOps that the WMO numbers in our tracking spreadsheet are the last of Canadian pre-allocated WMO numbers. Once those have been used, request WMO numbers on demand when deployment plans have been formed. If WMO is needed without a deployment plan, can submit a deployment location of (0, 0) to OceanOps. Action: Chris to confirm with Victor at OceanOps that the list of WMO numbers in tracking spreadsheet are indeed assigned to Argo Canada.\nBODC running coriolis processing chain (not container implementation yet) alongside their core chain. Not unlike the parallel core/BGC systems Anh is operating at MEDS. May be something to consider in moving to a more common infrastructure if/when possible. No action at this time.\nSome MEDS floats are failing synthetic profile build at coriolis. Action: check synthetic profile error log for MEDS floats, investigate source of error. (#12)\nReminder of RBR sqareroot error/correction procedure. Action: have we implemented this correction? (#13)\nDay 5\nFor NOVA and deep ARVOR floats, should indicate time-of-day (TOD) sampling in config variable in meta file. More widely, Chris and Anh need to review/update meta config variables on a per-float-type basis. Action: Chris and Anh to review/update config variables in meta file to match float configuration as well as TOD sampling. (#14)\nIce avoidance information should be stored in netCDF files as well. See John Gilson’s presentation. Action: Ice floats should have ISA info included in netCDF file. (#15)\n\n\n\n",
    "preview": {},
    "last_modified": "2025-04-12T00:35:48+00:00",
    "input_file": {}
  },
  {
    "path": "notes/2024-09-17-argo-technical-workshop-argo-canada-debrief/",
    "title": "Argo Technical Workshop - Argo Canada Debrief",
    "description": "Relevant notes from the Argo Technical Workshop held September 10-13 in Seattle, WA",
    "author": [
      {
        "name": "Christopher Gordon",
        "url": "https://github.com/cgrdn"
      }
    ],
    "date": "2024-09-17",
    "categories": [],
    "contents": "\nMeeting Notes\nEffort to standardize the Argo mission\nDiscussion surrounding the technical details of standardizing the Argo mission, including cycle timing (not equal exactly 10 days) and park depth sampling (hourly T/P, 6-hour S). More experienced user groups will still set up their floats as they see fit. The goal is not to control how these type of groups program their floats, but to ensure smaller users that may not change the floats from their default configuration have an Argo mission compliant setup.\nAlso, Argo Canada’s sampling is not very typical of the array - we chose a setup that maximized the number of 1 dbar bins within our Iridium plan. 2 dbar bins throughout the water column is more common (CSIRO, Ifremer) or at least to 1000 dbar (UW), with 1 dbar bins only at the very surface. Our current setup returns just under 675 points (18-22 sbd messages, ~6kB). Moving to 1/2/10 with 20/1000 depth thresholds would result in 610 points. Our current park sample strategy is the NKE default, 12 hours, with some exceptions (Dal PROVORs sampling hourly).\nConnection with TWR\nConnecting with TWR staff was a helpful part of the week including getting some hands on experience with APEX floats. Pre-deployment testing will be similar, though there are some differences in deployment. General notes:\nshipped in IDLE (pressure activation) mode\nwork with floats though terminal emulator as before, but physical connection rather than bluetooth\nbased on physical connection, could have a much easier shipboard setup to test floats (ex. dedicated laptop, macro to run test, teraterm always open and active); unsure if TWR supplies necessary connection?\ncan fill bottom of the float (? there is a word for this) using a bucket to encourage faster sinking\nTWR developing in house tool for production testing that they want to eventually have users access - opportunity to be beta users\nTWR will contact us for RUDICS activation\nLarge amount of onboard storage, all test information, pressure inquiries in IDLE mode stored\nWill need to provide rough deployment regions before order is complete, floats need to be specifically ballasted\nChanges to Pre-deployment Routine\nAn emphasis on dockside testing was made, to (1) ensure problems do not arise in transport to a ship and (2) this also minimizes startup time as the GPS almanac will update. Typically we have testing within 1-2 months of a float going on a ship, but I would like to move that up to at least test the week of.\nSharing Raw Files w/ Manufacturers\nStrong recommendation to share raw data with float manufacturers so that they have access to the engineering data when helping address issues. Easy with SBD (add manufacturer email address to distribution list) but slightly more complicated with RUDICS. Will work with TWR to ensure they have access to RUDICS data (mirror on their server perhaps?). Does NKE already have access to the general RUDICS server? Do we need to revoke that?\nData Stream - upcoming new sensor on Dal float\nDalhousie is purchasing a PROVOR CTS5 that will be equipped with an RBR Tridente sensor instead of the SBS FLBB sensor. Data format coming from the float should be very similar, maybe different naming structure, but also may be differences in QC, processing, etc. Something to keep in mind.\nPolar Deployments\nTalked with Noe about deployments near ice - they will often let the float start its mission on deck (start to try to sink) in order to have the float sink faster and therefore reduce chance of hitting ice.\nNext Generation ARVOR\nNKE presented the next generation of ARVOR float. Hardware/structure is very similar, but software/firmware will have major upgrades and will address some of our complaints/issues from the past. Available 2025.\nFuture of Argo Tech\nArgo Tech plans to host quarterly virtual meetings and bi-annual in-person meetings. Next in person meeting September 2026 (WHOI?).\nNext two meetings will tentatively discuss float profiling, timing, parking, and the report to be made to the AST.\nAction Items\nA meeting report is being produced, however some action items are more relevant to Argo Canada than others. Those are listed here. Note that at the time of writing this the action items are still subject to change.\nData capture on pre-deployment testing: use binary or numerical scale to represent the level of pre-deployment dockside testing performed on a float.\nThis will encourage testing and allow for analysis of float failures in context of knowing the float was in working order as close to deployment as possible. Data capture methodology to be determined. Meta file may be a good place to store this data, however Argo Tech recognizes the challenges associated with additions to the data system.\nImproved sharing of post-deployment logs with vendors.\nTransmitted data and engineering log info should be sent to vendors so that they may monitor float performance as well. For SBD, simply add the preferred vendor email to the distribution list. For floats on RUDICS communication, collaborate with vendors to arrange appropriate access.\nArgo Tech asks for support as needed from AST/ADMT as DACs may need to facilitate.\nArgo Tech asks vendors to review and analyze data as it is submitted.\nEnhance understanding of float failure modes.\nLarger user groups should track float failures and present analysis at bi-annual Argo Tech meetings and/or updates at quarterly virtual meetings (see SIO failure analysis presentation as an example). Any systematic failures should be communicated to the vendors and the Argo Tech group to prevent deployment of compromised floats.\nImprove fault identification and record-keeping.\nThis action item is a call for improved record keeping prior to float deployment. This includes logging all interactions with the float, for example using date-stamped terminal logs. In addition, any problems discovered during float testing/ballasting/assembly should be formally recorded by the end user and shared with the vendor, even in cases where the problem can be fixed without any required RMA or similar action from vendors. WHOI maintains a github for this type of information, which is a good example to follow.\nUser groups will use ticketing systems provided by vendors for all float issues.\nUser groups, especially those with close relationships with float vendors or sensor manufacturers, will often bypass the typical customer service portals these companies have in place in favor of direct contact with a representative they may have a personal relationship with. Bypassing these types of ticketing systems however can lead to issues not being properly tracked internally by the vendors.\nUser groups should be motivated to use these ticketing systems as it is the best way for vendors to track issues, and make changes to their products based on that information. It is a way for both end users and vendors to contribute to the progress/reliability of a given float/sensor.\n\n\n\n",
    "preview": {},
    "last_modified": "2025-04-12T00:35:48+00:00",
    "input_file": {}
  },
  {
    "path": "notes/2024-06-20-argo-canada-data-management-team-updates-june-21-2024/",
    "title": "Argo Canada Data Management Team Updates - June 21, 2024",
    "description": "Summary of updates for meeting taking plaace on June 21, 2024.",
    "author": [
      {
        "name": "Christopher Gordon",
        "url": "https://github.com/cgrdn"
      }
    ],
    "date": "2024-06-20",
    "categories": [],
    "contents": "\nChris’ notes before the meeting are in regular text. Notes taken during the meeting are in italics.\nRecent Deployments\nRecent deployments (since May 1) include 5 floats in the Lab Sea (3 Dal CTS5, 2 BIO CTS4), 1 float deployed from the sailing vessel Oceanolog (read more here), and 2 floats deployed along line P (1 deep ARVOR, 1 CTS4 w/ Nitrate).\nGoing a little further back, in April 4 floats were deployed, 2 on the AZMP (BIO CTS4) and 2 southeast of South Africa (ARVOR).\nDal floats: profiled daily while ship was in the area, now on 5-day cycles. Parking at 2000m to use as a pseudo-sediment trap via the BBP parking hook (see here for an example)\nNitrate float (4902679) is not on GDAC yet (Nitrate processing in progress), profiling daily?\n\n\nProgram\nInstitute\nModel\nDate\nLatitude\nLongitude\nShip\nIMEI\nWMO\nSerial No.\nArgo Canada\nIOS\nPROVOR\n04 May, 2024\n49.2800\n-134.6700\nJOHN P. TULLY\n300125010116590\n4902679\nP44168-23CA001\nArgo ONC\nONC\nDeep ARVOR\n07 May, 2024\n49.8361\n-144.6701\nJOHN P. TULLY\n300534063507930\n4902631\nAD2700-22CA001\nArgo Dalhousie\nDal\nPROVOR\n13 May, 2024\n56.5010\n-52.5990\nCELTIC EXPLORER\n300125062423120\n4902686\nP53865-23CA003\nArgo Canada\nBIO\nARVOR\n16 May, 2024\n17.9857\n-65.0987\nOCEANOLOG\n300534062474370\n4902609\nAI2600-22CA007\nArgo Dalhousie\nDal\nPROVOR\n17 May, 2024\n56.6650\n-48.9770\nCELTIC EXPLORER\n300125062031400\n4902687\nP53865-23CA004\nArgo Dalhousie\nDal\nPROVOR\n22 May, 2024\n58.4275\n-49.4418\nCELTIC EXPLORER\n300125062035430\n4902688\nP53865-23CA005\nArgo Canada\nBIO\nPROVOR\n06 Jun, 2024\n59.5045\n-55.0209\nCAPT. JACQUES CARTIER\n300125010915310\n4902675\nP41305-23CA002\nArgo Canada\nBIO\nPROVOR\n06 Jun, 2024\n59.5044\n-55.0210\nCAPT. JACQUES CARTIER\n300125010917310\n4902677\nP41305-23CA004\n\nArctic & Antarctic Floats\n\nWMO\nBasin\nDeployment Date\nLast Cycle\nLast Cycle Date\n4902610\nBeaufort Sea\nSep 19, 2023\n29\nJun 21, 2024\n4902611\nBeaufort Sea\nOct 03, 2023\n25\nMay 27, 2024\n4902664\nRoss Sea\nFeb 07, 2024\n11\nFeb 28, 2024\n4902665\nRoss Sea\nJan 30, 2024\n1\nJan 31, 2024\n4902667\nRoss Sea\nFeb 07, 2024\n20\nMar 21, 2024\n4902668\nRoss Sea\nFeb 03, 2024\n8\nMar 02, 2024\n4902669\nRoss Sea\nFeb 07, 2024\n11\nFeb 28, 2024\n\nBeaufort:\nBoth Beaufort Sea floats have resurfaced! 4902610 not on GDAC yet.\nISA does not seem to have prevented floats from approaching/bumping into the ice\nLost some data - ex. 4902611 did 3 cycles before going under ice, but newly sent data starts at cycle 13: reduce vertical resolution before next season?\nRoss:\nMost floats have not reported since near deployment time, but 4902664 just reported on June 16, not on GDAC yet\n\n\n\nNitrate\nWriting of Nitrate RTQC code is in progress. Official documentation is here. RTQC for Nitrate includes:\nglobal range test\nspike test\nstuck value test\ngrey list test\nnitrate specific tests\nSpecific tests include checking for saturation of the spectrophotometer, absorbance at 240nm (evaluate sensor optics) and error fitting to a model. There is also a check for high bisulfide concentrations such as in the black sea, but these are special cases and likely only going to be evaluated by expert researchers.\nLike oxygen, unadjusted nitrate is flagged as 3 by default. If TEMP_QC is 4, NITRATE_QC is also 4, and if PSAL_QC is 4, NITRATE_QC should be 3 as well, including for adjusted, but this can be reviewed at the DMQC step.\nNear Surface Sampling\nAt the most recent AST Brian King presented on an evaluation of Argo floats sampling all the way to the surface. The defauly configuration of the CTD pump for NKE floats is to turn off the pump at 5dbar. I am in the process of changing this parameter to 2dbar for all floats and will use as the default going forward.\n\n\n\n",
    "preview": {},
    "last_modified": "2025-04-12T00:35:48+00:00",
    "input_file": {}
  },
  {
    "path": "notes/2023-11-10-argo-canada-data-management-team-updates-november-10-2023/",
    "title": "Argo Canada Data Management Team Updates - November 10, 2023",
    "description": "Summary for meeting taking place on November 10, 2023.",
    "author": [
      {
        "name": "Christopher Gordon",
        "url": "https://github.com/cgrdn"
      }
    ],
    "date": "2023-11-10",
    "categories": [],
    "contents": "\n\n\n\nUpdate/Takeaways from ADMT\nCHLA_ADJUSTED: Raphaelle Suazede presented on adjusting chlorophyll using a factor from a lookup table (date, location) or calculated based on first 5 cycles. Current process is to divide by 2 for all data (Roesler 2017). Simple to implement in python RTQC once we have LUT.\nRT adjustment of DOXY is a high priority. Can provide a gain value after 5 cycles, and populate DOXY_ADJUSTED in RT at python RTQC step. Chris needs to talk to Anh about this - new VMS variable and populating SCIENTIFIC_CALIB_COMMENT.\nCycle Timing\nCanadian floats are almost all compliant with time of day sampling. Only floats that appeared in Drucker/Riser audit list were NOVA, deep ARVOR floats and 2 very recently deployed ARVORs that have been reprogrammed to 235hr cycles already.\n\n\n\n\n\n\nDiscussion on indicating time of day sampling regime in the meta file by John Gilson via CONFIG_MISSION_COMMENT. Not totally clear to me but I think we are meant to set it to -1 (i.e. TOD sampling off?).\nPresented our method for actively reprogramming PROVOR floats to effectively result in 235 hour cycles.\n\n\n\nPROVOR CTS5 floats: the new floats will require new syntax to reprogram, and also carry radiometry sensors. Plan will be to cycle through 24hr cycle plus extra local noon surfacings through the year.\n\n\n\nRTQC Of PROVOR CTS5 Floats\nNeed to add radiometry RTQC to python setup - just range test, very simple\nDMQC Updates\n4 floats ready for submission, going to do a couple more and submit as a batch\nMaking an effort to do 1-2/week right now\nWill need to spend some time validating in-air method in code\nUpon DMQC, updating DOXY_QC=1 to DOXY_QC=3. Should we do that for all files more urgently?\nDeployment Summary\nAll completed and planned deployments can be seen on the development blog planning page.\nSo far in 2023, 24 floats have been deployed:\n5 PROVOR / 14 ARVOR / 5 deep ARVOR\n11 BIO / 8 IOS / 5 ONC\n3 RBR / 21 SBE\nIn the remainder of 2023 and into early 2024, 13 more deployments are planned:\n2 PROVOR CTS5 / 9 ARVOR / 3 deep ARVOR\n7 BIO / 2 IOS / 2 ONC / 2 Dalhousie\n4 RBR / 9 SBE\nNotable deployments:\nThe crew of the DISCOVREY will be deploying 6 floats on their way to Cape Town, South Africa.\nAn additional 6 floats (not in table) will be delivered to a vessel in Cape Town via the DISCOVERY for deployment in the Western Indian Ocean, date TBD.\nThe HMCS VANCOUVER will deploy 2 floats near Hawaii\nThe 2 PROVOR CTS5 floats will be deployed in the Lab Sea from the MERIAN, being loaded on November 21.\nThe sailing vessel OCEANOLOG will deploy an ARVOR float as part of Sail for Science\n2 deep ARVOR floats will be deployed from the HESPERIDES in the Southern Ocean (more floats to avoid ice!)\nAn additional 5 floats (not in the table) will be sent on a joint Italian/NZ voyage to the Ross Sea\nBeaufort Floats\nFloat Programming\nThe two floats deployed in the Beaufort Sea (4902610 and 4902611) were updated with new ice sensing algorithm (ISA) parameters. The parameters were provided by Steve Jayne based on data analysis of the Beaufort Gyre.\nISA works by detecting a temperature threshold over a certain depth range. The suggested range was between 20-10dbar with a threshold of -1.21deg C (90% success rate of avoiding ice when present) or -1.03 deg C (95% success rate).\nI ran the parameter change by Jerome at NKE. He was cautious about it as the depth range Steve provided was more shallow than their default setting (-1.79 deg C between 50 and 20dbar), but that the changes looked fine in terms of reprogramming the float:\n!MC 2 235    # cycle timing\n!MC 3 235    # cycle timing phase 2, inaccessible\n!MC 17 475   # surface/mid threshold \n!MC 18 1000  # mid/bottom threshold\n!MC 20 5     # mid resolution\n!MC 21 10    # bottom resolution\n!IC 2 3      # number of detections to confirm ice, default\n!IC 3 20     # start pressure detection\n!IC 4 10     # stop pressure detection\n!IC 5 -1210  # temperature threshold, millidegrees\nBoth floats successfully received the parameter change, but I cannot see ice parameter values in the messages. May consult NKE on this.\nPreliminary Data\nFloat 4902610 collected 2 profiles before stopping reporting (last Oct 1, 2023). Float 4902611 has collected 3 (last reported Oct 25, 2023).\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "preview": {},
    "last_modified": "2025-04-12T00:35:48+00:00",
    "input_file": {}
  }
]
